fingerprint-attendance-server/load-tests/attendance-scenario.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 300
      arrivalRate: 20
      name: Query load
  defaults:
    headers:
      Authorization: "Bearer {{ token }}"

scenarios:
  - name: "Attendance Queries"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "admin_test"
            password: "admin123"
          capture:
            - json: "$.access_token"
              as: "token"
      - get:
          url: "/api/attendance/logs?startDate=2024-01-01&endDate=2024-01-31"
      - think: 2
      - get:
          url: "/api/attendance/calculate?start_date=2024-01-01&end_date=2024-01-31"
      - think: 2
      - get:
          url: "/api/attendance/summary"